[
  {
    "id": "onboarding",
    "icon": "material-symbols:jamboard-kiosk-outline",
    "title": "Onboarding",
    "description": "Guide new hires through a complete digital onboarding journey including compliance checks, document signing, profile setup, and first-day planning for a smooth start.",
    "fullDescription": "ZetScore's Onboarding module handles the entire new employee welcome process in one place. It includes work authorization verification, manager-assigned documents for viewing, acknowledging, or signing, background check initiation, employee bio and profile picture updates, additional personal information questions to help managers understand their team better, and a customizable first-day itinerary sent directly by the manager. Everything is digital, trackable, and designed to make the transition fast and professional.",
    "image": "/Onboarding.jpg",
    "author": "ZetScore Team",
    "date": "2025-07-15",
    "readingTime": "5 min read",
    "overview": "Transform your new hire experience from paperwork chaos to a structured, digital flow that covers everything from legal compliance to personal introductions and day-one readiness.",
    "keyBenefits": [
      "Everything in one digital platform no scattered emails or paper",
      "Manager involvement for personalized documents, questions, and first-day plans",
      "Quick compliance with work authorization and background checks",
      "Better team connection through bio updates and personal info sharing",
      "Improved new hire confidence and faster productivity"
    ],
    "challengesSolved": "We fix the usual onboarding headaches: lost documents, delayed signatures, forgotten compliance steps, generic experiences, and poor first impressions that lead to early turnover or confusion."
  },
  {
    "id": "background-checks",
    "icon": "fluent-mdl2:compliance-audit",
    "title": "Background Checks",
    "description": "Verify candidate education and documents by reaching out to institutions like schools or universities to confirm everything is accurate and legitimate.",
    "fullDescription": "Our Background Checks feature allows you to initiate and track verification of key documents. We send requests to the relevant institutions (for example, the schools or universities where the candidate studied) to confirm attendance, degrees, certificates, and other claimed qualifications. This ensures all information provided is genuine, helping you make confident hiring decisions while staying compliant.",
    "image": "/backgroundcheck.jpg",
    "author": "ZetScore Team",
    "date": "2025-08-15",
    "readingTime": "4 min read",
    "overview": "Get reliable confirmation of a candidate's educational and professional background through direct institutional verification — simple, secure, and thorough.",
    "keyBenefits": [
      "Direct verification with schools and institutions for accuracy",
      "Clear status tracking so you know exactly where things stand",
      "Reduces risk of fake credentials or misrepresentations",
      "Supports fair and informed hiring decisions",
      "Keeps the process organized and documented"
    ],
    "challengesSolved": "We remove the hassle and uncertainty of manual follow-ups, phone calls, and potential fraud by automating institutional checks and providing a clear audit trail."
  },
  {
    "id": "work-authorization",
    "icon": "fluent-mdl2:open-enrollment",
    "title": "Work Authorization",
    "description": "Securely collect and verify work permits, passports, and other documents to confirm new hires are legally eligible to work.",
    "fullDescription": "With ZetScore Work Authorization, new employees upload their key documents — such as passports, work permits, visas, or other proof of eligibility — directly in the platform. The system allows HR or managers to review and verify these submissions to ensure full compliance with employment laws before onboarding proceeds. It's straightforward, secure, and keeps everything in one place.",
    "image": "/WorkAuthorization.jpg",
    "author": "ZetScore Team",
    "date": "2025-09-15",
    "readingTime": "6 min read",
    "overview": "Make sure every new hire is legally cleared to work by handling document submission and verification digitally — fast, compliant, and stress-free.",
    "keyBenefits": [
      "Easy document upload for employees",
      "Quick review and approval by managers or HR",
      "Ensures legal compliance from day one",
      "Secure storage and easy access for audits",
      "Prevents delays in starting work due to missing paperwork"
    ],
    "challengesSolved": "We eliminate the back-and-forth of emailing sensitive documents, lost files, and compliance gaps that can delay onboarding or create legal risks for the business."
  }
]